{
  "document": { "title": "TERMS OF SERVICE" },
  "company": {
    "name": "Northstar Utilities",
    "address": "P.O. Box 3607, Houston, TX 77253",
    "logoUrl": "data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSIxMjAiIGhlaWdodD0iNjAiPjxyZWN0IHdpZHRoPSIxMjAiIGhlaWdodD0iNjAiIGZpbGw9IiNlZWVlZWUiLz48dGV4dCB4PSI2MCIgeT0iMzUiIGZvbnQtc2l6ZT0iMTYiIHRleHQtYW5jaG9yPSJtaWRkbGUiIGZpbGw9IiMzMzMiPkxPR088L3RleHQ+PC9zdmc+"
  },
  "termsText": "SECTION A\nPrepaid Disclosure Statement (PDS): a document associated with a prepaid plan that provides the Connection Balance, Disconnection Balance, and other details regarding the plan.\n\nResidential Customer: retail customers classified as residential by the applicable bundled utility tariff, unbundled transmission and distribution utility tariff or, in the absence of classification under a residential rate class, those retail customers that are primarily end users consuming electricity at the customer’s place of residence for personal, family or household purposes and who are not resellers of electricity.\n\nRules: the SUC Substantive Rules applicable to Retail Electric Providers and regional grid operator protocols.\n\nSanctioned Person: any person that is (a) the subject or target of Sanctions or (b) located, organized or ordinarily resident in a Sanctioned Territory, or (c) 50 percent or more owned or controlled (as such term is defined by the relevant Sanctions) by one or more persons described in paragraph (a) or (b).\n\nSanctioned Territory: at any time, a country or territory which is the subject or target of a comprehensive Sanctions, including the so-called Donetsk People’s Republic, the so-called Luhansk People’s Republic, Crimea, Cuba, Iran, North Korea, and Syria, and (b) other broad Sanctions, including Afghanistan, Belarus, Russia and Venezuela.\n\nSanctions: any economic, financial or trade sanctions or restrictions administered or enforced by Canada (including government of any province or territory thereof), the United States (including the Office of Foreign Assets Control of the U.S. Department of the Treasury), the European Union, the United Kingdom, or other relevant sanctions authority.\n\nConnection Balance: the balance required to establish or reconnect prepaid service.\n\nBase Charge: a charge assessed during each billing cycle to each ESI ID without regard to the customer’s demand or energy consumption.\n\nBilling Cycle: the period between billings for a given account, which may be monthly or otherwise.\n\nAutoPay: an automatic payment system offering customers the convenience of having their payments automatically withdrawn from a bank account or charged to a credit or debit card as an authorized payment method.\n\nCustomer: the account holder receiving electric service under this agreement.\n\nContract: collectively, the Letter of Authorization (front page), these Terms of Service, the Electricity Facts Label (EFL), Your Rights as a Customer (YRAC), and the Prepaid Disclosure Statement (PDS).\n\nSECTION B\nThis section continues to demonstrate flow text across multiple pages. The intent is to force pagination so you can verify header and footer repetition and multi-column layout. Add additional paragraphs as needed to increase page count.\n\nSECTION C\nPrepaid plans may require a minimum balance. Disconnection may occur if the balance falls below required thresholds. Restoration may require additional deposits or fees. Customers should review all notices before making changes.\n\nSECTION D\nAdditional definitions and disclosures may appear in this section. This placeholder text is intentionally verbose to trigger multiple pages in the renderer and confirm that the flow text algorithm is working across pages and columns.\n\nSECTION E\nAll terms are subject to change with proper notice. This section is part of a long-form terms and conditions example for pagination testing.\n\nSECTION F\nContact information, dispute resolution, and governing law are listed in the full agreement. This block is repeated to ensure multiple pages are generated in the PDF output."
}
